rhuitl/linux/arch/arm/mach-nuc700/include/mach/mfp-nuc710.h
/*
 * arch/arm/mach-nuc700/include/mach/mfp.h
 *
 * Copyright (c) 2011 Nuvoton technology corporation.
 *
 * Wan ZongShun <mcuos.com@gmail.com>
 *
 * Based on arch/arm/mach-s3c2410/include/mach/map.h
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation;version 2 of the License.
 *
 */

#include<mach/mfp.h>

#ifndef __ASM_ARCH_MFP_NUC710_H
#define __ASM_ARCH_MFP_NUC710_H

/*PT0*/

/* GPIO */
#define GPIO0_GPIO0		CFG(0, FN0, GPIO_PT0_OFFSET)
#define GPIO1_GPIO1		CFG(1, FN0, GPIO_PT0_OFFSET)
#define GPIO2_GPIO2		CFG(2, FN0, GPIO_PT0_OFFSET)
#define GPIO3_GPIO3		CFG(3, FN0, GPIO_PT0_OFFSET)
#define GPIO4_GPIO4		CFG(4, FN0, GPIO_PT0_OFFSET)

/* AC97 */
#define GPIO0_AC97_NRESET	CFG(0, FN1, GPIO_PT0_OFFSET)
#define GPIO1_AC97_DATAI	CFG(1, FN1, GPIO_PT0_OFFSET)
#define GPIO2_AC97_DATAO	CFG(2, FN1, GPIO_PT0_OFFSET)
#define GPIO3_AC97_SYNC		CFG(3, FN1, GPIO_PT0_OFFSET)
#define GPIO4_AC97_BITCLK	CFG(4, FN1, GPIO_PT0_OFFSET)

/* IRQ4 */
#define GPIO0_nIRQ4		CFG(0, FN2, GPIO_PT0_OFFSET)

/* PWM */
#define GPIO1_PWM0		CFG(1, FN2, GPIO_PT0_OFFSET)
#define GPIO2_PWM1		CFG(2, FN2, GPIO_PT0_OFFSET)
#define GPIO3_PWM2		CFG(3, FN2, GPIO_PT0_OFFSET)
#define GPIO4_PWM3		CFG(4, FN2, GPIO_PT0_OFFSET)

/* USB PWREN */
#define GPIO0_USB_PWREN		CFG(0, FN3, GPIO_PT0_OFFSET)

/* UART3 */
#define GPIO1_UART_DTR3		CFG(1, FN3, GPIO_PT0_OFFSET)
#define GPIO2_UART_DSR3		CFG(2, FN3, GPIO_PT0_OFFSET)
#define GPIO3_UART_TXD3		CFG(3, FN3, GPIO_PT0_OFFSET)
#define GPIO4_UART_RXD3		CFG(4, FN3, GPIO_PT0_OFFSET)

/*PT1*/

/* GPIO */
#define GPIO20_GPIO20		CFG(0, FN0, GPIO_PT1_OFFSET)
#define GPIO21_GPIO21		CFG(1, FN0, GPIO_PT1_OFFSET)
#define GPIO22_GPIO22		CFG(2, FN0, GPIO_PT1_OFFSET)
#define GPIO23_GPIO23		CFG(3, FN0, GPIO_PT1_OFFSET)
#define GPIO24_GPIO24		CFG(4, FN0, GPIO_PT1_OFFSET)
#define GPIO25_GPIO25		CFG(5, FN0, GPIO_PT1_OFFSET)
#define GPIO26_GPIO26		CFG(6, FN0, GPIO_PT1_OFFSET)
#define GPIO27_GPIO27		CFG(7, FN0, GPIO_PT1_OFFSET)
#define GPIO28_GPIO28		CFG(8, FN0, GPIO_PT1_OFFSET)
#define GPIO29_GPIO29		CFG(9, FN0, GPIO_PT1_OFFSET)

#define GPIO20_nXDACK		CFG(0, FN1, GPIO_PT1_OFFSET)
#define GPIO21_nXDREQ		CFG(1, FN1, GPIO_PT1_OFFSET)
#define GPIO22_SDCD		CFG(2, FN1, GPIO_PT1_OFFSET)
#define GPIO24_SDDAT3		CFG(4, FN1, GPIO_PT1_OFFSET)
#define GPIO25_SDDAT2		CFG(5, FN1, GPIO_PT1_OFFSET)
#define GPIO26_SDDAT1		CFG(6, FN1, GPIO_PT1_OFFSET)
#define GPIO27_SDDAT0		CFG(7, FN1, GPIO_PT1_OFFSET)
#define GPIO28_SDCLK		CFG(8, FN1, GPIO_PT1_OFFSET)
#define GPIO29_SDCMD		CFG(9, FN1, GPIO_PT1_OFFSET)

#define GPIO20_SC1_PWR		CFG(0, FN2, GPIO_PT1_OFFSET)
#define GPIO21_SC1_PRES		CFG(1, FN2, GPIO_PT1_OFFSET)
#define GPIO22_SC1_RST		CFG(2, FN2, GPIO_PT1_OFFSET)
#define GPIO23_SC1_CLK		CFG(3, FN2, GPIO_PT1_OFFSET)
#define GPIO24_SC1_DAT		CFG(4, FN2, GPIO_PT1_OFFSET)
#define GPIO25_SC0_PWR		CFG(5, FN2, GPIO_PT1_OFFSET)
#define GPIO26_SC0_PRES		CFG(6, FN2, GPIO_PT1_OFFSET)
#define GPIO27_SC0_RST		CFG(7, FN2, GPIO_PT1_OFFSET)
#define GPIO28_SC0_CLK		CFG(8, FN2, GPIO_PT1_OFFSET)
#define GPIO29_SC0_DAT		CFG(9, FN2, GPIO_PT1_OFFSET)

#define GPIO20_VD8		CFG(0, FN3, GPIO_PT1_OFFSET)
#define GPIO21_VD9		CFG(1, FN3, GPIO_PT1_OFFSET)
#define GPIO22_VD10		CFG(2, FN3, GPIO_PT1_OFFSET)
#define GPIO23_VD11		CFG(3, FN3, GPIO_PT1_OFFSET)
#define GPIO24_VD12		CFG(4, FN3, GPIO_PT1_OFFSET)
#define GPIO25_VD13		CFG(5, FN3, GPIO_PT1_OFFSET)
#define GPIO26_VD14		CFG(6, FN3, GPIO_PT1_OFFSET)
#define GPIO27_VD15		CFG(7, FN3, GPIO_PT1_OFFSET)
#define GPIO28_VD16		CFG(8, FN3, GPIO_PT1_OFFSET)
#define GPIO29_VD17		CFG(9, FN3, GPIO_PT1_OFFSET)
/*PT2*/

/* GPIO */
#define GPIO42_GPIO42		CFG(0, FN0, GPIO_PT2_OFFSET)
#define GPIO43_GPIO43		CFG(1, FN0, GPIO_PT2_OFFSET)
#define GPIO44_GPIO44		CFG(2, FN0, GPIO_PT2_OFFSET)
#define GPIO45_GPIO45		CFG(3, FN0, GPIO_PT2_OFFSET)
#define GPIO46_GPIO46		CFG(4, FN0, GPIO_PT2_OFFSET)
#define GPIO47_GPIO47		CFG(5, FN0, GPIO_PT2_OFFSET)
#define GPIO48_GPIO48		CFG(6, FN0, GPIO_PT2_OFFSET)
#define GPIO49_GPIO49		CFG(7, FN0, GPIO_PT2_OFFSET)
#define GPIO50_GPIO50		CFG(8, FN0, GPIO_PT2_OFFSET)
#define GPIO51_GPIO51		CFG(9, FN0, GPIO_PT2_OFFSET)

#define GPIO42_PHYRXERR		CFG(0, FN1, GPIO_PT2_OFFSET)
#define GPIO43_PHYCRSDV		CFG(1, FN1, GPIO_PT2_OFFSET)
#define GPIO44_PHYRXD0		CFG(2, FN1, GPIO_PT2_OFFSET)
#define GPIO45_PHYRXD1		CFG(3, FN1, GPIO_PT2_OFFSET)
#define GPIO46_PHYREFCLK	CFG(4, FN1, GPIO_PT2_OFFSET)
#define GPIO47_PHYTXEN		CFG(5, FN1, GPIO_PT2_OFFSET)
#define GPIO48_PHYTXD0		CFG(6, FN1, GPIO_PT2_OFFSET)
#define GPIO49_PHYTXD1		CFG(7, FN1, GPIO_PT2_OFFSET)
#define GPIO50_PHYMDIO		CFG(8, FN1, GPIO_PT2_OFFSET)
#define GPIO51_PHYMDC		CFG(9, FN1, GPIO_PT2_OFFSET)

#define GPIO42_KPCOL0		CFG(0, FN2, GPIO_PT2_OFFSET)
#define GPIO43_KPCOL1		CFG(1, FN2, GPIO_PT2_OFFSET)
#define GPIO44_KPCOL2		CFG(2, FN2, GPIO_PT2_OFFSET)
#define GPIO45_KPCOL3		CFG(3, FN2, GPIO_PT2_OFFSET)
#define GPIO46_KPCOL4		CFG(4, FN2, GPIO_PT2_OFFSET)
#define GPIO47_KPCOL5		CFG(5, FN2, GPIO_PT2_OFFSET)
#define GPIO48_KPCOL6		CFG(6, FN2, GPIO_PT2_OFFSET)
#define GPIO49_KPCOL7		CFG(7, FN2, GPIO_PT2_OFFSET)
#define GPIO50_KPROW0		CFG(8, FN2, GPIO_PT2_OFFSET)
#define GPIO51_KPROW1		CFG(9, FN2, GPIO_PT2_OFFSET)

#define GPIO42_VD8		CFG(0, FN3, GPIO_PT2_OFFSET)
#define GPIO43_VD9		CFG(1, FN3, GPIO_PT2_OFFSET)
#define GPIO44_VD10		CFG(2, FN3, GPIO_PT2_OFFSET)
#define GPIO45_VD11		CFG(3, FN3, GPIO_PT2_OFFSET)
#define GPIO46_VD12		CFG(4, FN3, GPIO_PT2_OFFSET)
#define GPIO47_VD13		CFG(5, FN3, GPIO_PT2_OFFSET)
#define GPIO48_VD14		CFG(6, FN3, GPIO_PT2_OFFSET)
#define GPIO49_VD15		CFG(7, FN3, GPIO_PT2_OFFSET)
#define GPIO50_VD16		CFG(8, FN3, GPIO_PT2_OFFSET)
#define GPIO51_VD17		CFG(9, FN3, GPIO_PT2_OFFSET)
/*PT3*/

/* GPIO */
#define GPIO60_GPIO60		CFG(0, FN0, GPIO_PT3_OFFSET)
#define GPIO61_GPIO61		CFG(1, FN0, GPIO_PT3_OFFSET)
#define GPIO62_GPIO62		CFG(2, FN0, GPIO_PT3_OFFSET)
#define GPIO63_GPIO63		CFG(3, FN0, GPIO_PT3_OFFSET)
#define GPIO64_GPIO64		CFG(4, FN0, GPIO_PT3_OFFSET)
#define GPIO65_GPIO65		CFG(5, FN0, GPIO_PT3_OFFSET)
#define GPIO66_GPIO66		CFG(6, FN0, GPIO_PT3_OFFSET)
#define GPIO67_GPIO67		CFG(7, FN0, GPIO_PT3_OFFSET)

#define GPIO60_D24		CFG(0, FN1, GPIO_PT3_OFFSET)
#define GPIO61_D25		CFG(1, FN1, GPIO_PT3_OFFSET)
#define GPIO62_D26		CFG(2, FN1, GPIO_PT3_OFFSET)
#define GPIO63_D27		CFG(3, FN1, GPIO_PT3_OFFSET)
#define GPIO64_D28		CFG(4, FN1, GPIO_PT3_OFFSET)
#define GPIO65_D29		CFG(5, FN1, GPIO_PT3_OFFSET)
#define GPIO66_D30		CFG(6, FN1, GPIO_PT3_OFFSET)
#define GPIO67_D31		CFG(7, FN1, GPIO_PT3_OFFSET)

#define GPIO60_VD16		CFG(0, FN2, GPIO_PT3_OFFSET)
#define GPIO61_VD17		CFG(1, FN2, GPIO_PT3_OFFSET)
#define GPIO62_VD18		CFG(2, FN2, GPIO_PT3_OFFSET)
#define GPIO63_VD19		CFG(3, FN2, GPIO_PT3_OFFSET)
#define GPIO64_VD20		CFG(4, FN2, GPIO_PT3_OFFSET)
#define GPIO65_VD21		CFG(5, FN2, GPIO_PT3_OFFSET)
#define GPIO66_VD22		CFG(6, FN2, GPIO_PT3_OFFSET)
#define GPIO67_VD23		CFG(7, FN2, GPIO_PT3_OFFSET)

/*PT4*/

/* GPIO */
#define GPIO52_GPIO52		CFG(0, FN0, GPIO_PT4_OFFSET)
#define GPIO53_GPIO53		CFG(1, FN0, GPIO_PT4_OFFSET)
#define GPIO54_GPIO54		CFG(2, FN0, GPIO_PT4_OFFSET)
#define GPIO55_GPIO55		CFG(3, FN0, GPIO_PT4_OFFSET)
#define GPIO56_GPIO56		CFG(4, FN0, GPIO_PT4_OFFSET)
#define GPIO57_GPIO57		CFG(5, FN0, GPIO_PT4_OFFSET)
#define GPIO58_GPIO58		CFG(6, FN0, GPIO_PT4_OFFSET)
#define GPIO59_GPIO59		CFG(7, FN0, GPIO_PT4_OFFSET)
#define GPIO68_GPIO68		CFG(8, FN0, GPIO_PT4_OFFSET)
#define GPIO69_GPIO69		CFG(9, FN0, GPIO_PT4_OFFSET)
#define GPIO70_GPIO70		CFG(10, FN0, GPIO_PT4_OFFSET)

#define GPIO52_D16		CFG(0, FN1, GPIO_PT4_OFFSET)
#define GPIO53_D17		CFG(1, FN1, GPIO_PT4_OFFSET)
#define GPIO54_D18		CFG(2, FN1, GPIO_PT4_OFFSET)
#define GPIO55_D19		CFG(3, FN1, GPIO_PT4_OFFSET)
#define GPIO56_D20		CFG(4, FN1, GPIO_PT4_OFFSET)
#define GPIO57_D21		CFG(5, FN1, GPIO_PT4_OFFSET)
#define GPIO58_D22		CFG(6, FN1, GPIO_PT4_OFFSET)
#define GPIO59_D23		CFG(7, FN1, GPIO_PT4_OFFSET)
#define GPIO68_nWE2		CFG(8, FN1, GPIO_PT4_OFFSET)
#define GPIO69_nWE3		CFG(9, FN1, GPIO_PT4_OFFSET)
#define GPIO70_nWAIT		CFG(10, FN1, GPIO_PT4_OFFSET)

#define GPIO52_VD8		CFG(0, FN2, GPIO_PT4_OFFSET)
#define GPIO53_VD9		CFG(1, FN2, GPIO_PT4_OFFSET)
#define GPIO54_VD10		CFG(2, FN2, GPIO_PT4_OFFSET)
#define GPIO55_VD11		CFG(3, FN2, GPIO_PT4_OFFSET)
#define GPIO56_VD12		CFG(4, FN2, GPIO_PT4_OFFSET)
#define GPIO57_VD13		CFG(5, FN2, GPIO_PT4_OFFSET)
#define GPIO58_VD14		CFG(6, FN2, GPIO_PT4_OFFSET)
#define GPIO59_VD15		CFG(7, FN2, GPIO_PT4_OFFSET)
#define GPIO70_nIRQ5		CFG(10, FN2, GPIO_PT4_OFFSET)

/*PT5*/

/* GPIO */
#define GPIO5_GPIO5		CFG(0, FN0, GPIO_PT5_OFFSET)
#define GPIO6_GPIO6		CFG(1, FN0, GPIO_PT5_OFFSET)
#define GPIO7_GPIO7		CFG(2, FN0, GPIO_PT5_OFFSET)
#define GPIO8_GPIO8		CFG(3, FN0, GPIO_PT5_OFFSET)
#define GPIO9_GPIO9		CFG(4, FN0, GPIO_PT5_OFFSET)
#define GPIO10_GPIO10		CFG(5, FN0, GPIO_PT5_OFFSET)
#define GPIO11_GPIO11		CFG(6, FN0, GPIO_PT5_OFFSET)
#define GPIO12_GPIO12		CFG(7, FN0, GPIO_PT5_OFFSET)
#define GPIO13_GPIO13		CFG(8, FN0, GPIO_PT5_OFFSET)
#define GPIO14_GPIO14		CFG(9, FN0, GPIO_PT5_OFFSET)
#define GPIO15_GPIO15		CFG(10, FN0, GPIO_PT5_OFFSET)
#define GPIO16_GPIO16		CFG(11, FN0, GPIO_PT5_OFFSET)
#define GPIO17_GPIO17		CFG(12, FN0, GPIO_PT5_OFFSET)
#define GPIO18_GPIO18		CFG(13, FN0, GPIO_PT5_OFFSET)
#define GPIO19_GPIO19		CFG(14, FN0, GPIO_PT5_OFFSET)

#define GPIO5_TXD0		CFG(0, FN1, GPIO_PT5_OFFSET)
#define GPIO6_RXD0		CFG(1, FN1, GPIO_PT5_OFFSET)
#define GPIO7_TXD1		CFG(2, FN1, GPIO_PT5_OFFSET)
#define GPIO8_RXD1		CFG(3, FN1, GPIO_PT5_OFFSET)
#define GPIO9_TXD2		CFG(4, FN1, GPIO_PT5_OFFSET)
#define GPIO10_RXD2		CFG(5, FN1, GPIO_PT5_OFFSET)
#define GPIO11_SCL0		CFG(6, FN1, GPIO_PT5_OFFSET)
#define GPIO12_SDA0		CFG(7, FN1, GPIO_PT5_OFFSET)
#define GPIO13_SCL1		CFG(8, FN1, GPIO_PT5_OFFSET)
#define GPIO14_SDA1		CFG(9, FN1, GPIO_PT5_OFFSET)
#define GPIO15_nWDOG		CFG(10, FN1, GPIO_PT5_OFFSET)
#define GPIO16_nIRQ0		CFG(11, FN1, GPIO_PT5_OFFSET)
#define GPIO17_nIRQ1		CFG(12, FN1, GPIO_PT5_OFFSET)
#define GPIO18_nIRQ2		CFG(13, FN1, GPIO_PT5_OFFSET)
#define GPIO19_nIRQ3		CFG(14, FN1, GPIO_PT5_OFFSET)

#define GPIO9_CTS1		CFG(4, FN2, GPIO_PT5_OFFSET)
#define GPIO10_RTS1		CFG(5, FN2, GPIO_PT5_OFFSET)
#define GPIO11_SFRM		CFG(6, FN2, GPIO_PT5_OFFSET)
#define GPIO12_SSPTX		CFG(7, FN2, GPIO_PT5_OFFSET)
#define GPIO13_SSPSCLK		CFG(8, FN2, GPIO_PT5_OFFSET)
#define GPIO14_SSPRXD		CFG(9, FN2, GPIO_PT5_OFFSET)
#define GPIO15_USBPWREN		CFG(10, FN2, GPIO_PT5_OFFSET)
#define GPIO17_USBOVCUR		CFG(12, FN2, GPIO_PT5_OFFSET)

#define GPIO9_PS2CLK		CFG(4, FN3, GPIO_PT5_OFFSET)
#define GPIO10_PS2DATA		CFG(5, FN3, GPIO_PT5_OFFSET)
#define GPIO11_TIMER0		CFG(6, FN3, GPIO_PT5_OFFSET)
#define GPIO12_TIMER1		CFG(7, FN3, GPIO_PT5_OFFSET)
#define GPIO13_KPROW3		CFG(8, FN3, GPIO_PT5_OFFSET)
#define GPIO14_KPROW2		CFG(9, FN3, GPIO_PT5_OFFSET)
/*PT6*/

/* GPIO */
#define GPIO30_GPIO30		CFG(0, FN0, GPIO_PT6_OFFSET)
#define GPIO31_GPIO31		CFG(1, FN0, GPIO_PT6_OFFSET)
#define GPIO32_GPIO32		CFG(2, FN0, GPIO_PT6_OFFSET)
#define GPIO33_GPIO33		CFG(3, FN0, GPIO_PT6_OFFSET)
#define GPIO34_GPIO34		CFG(4, FN0, GPIO_PT6_OFFSET)
#define GPIO35_GPIO35		CFG(5, FN0, GPIO_PT6_OFFSET)
#define GPIO36_GPIO36		CFG(6, FN0, GPIO_PT6_OFFSET)
#define GPIO37_GPIO37		CFG(7, FN0, GPIO_PT6_OFFSET)
#define GPIO38_GPIO38		CFG(8, FN0, GPIO_PT6_OFFSET)
#define GPIO39_GPIO39		CFG(9, FN0, GPIO_PT6_OFFSET)
#define GPIO40_GPIO40		CFG(10, FN0, GPIO_PT6_OFFSET)
#define GPIO41_GPIO41		CFG(11, FN0, GPIO_PT6_OFFSET)

#define GPIO30_VCLK		CFG(0, FN1, GPIO_PT6_OFFSET)
#define GPIO31_VDEN		CFG(1, FN1, GPIO_PT6_OFFSET)
#define GPIO32_VSYNC		CFG(2, FN1, GPIO_PT6_OFFSET)
#define GPIO33_HSYNC		CFG(3, FN1, GPIO_PT6_OFFSET)
#define GPIO34_VD0		CFG(4, FN1, GPIO_PT6_OFFSET)
#define GPIO35_VD1		CFG(5, FN1, GPIO_PT6_OFFSET)
#define GPIO36_VD2		CFG(6, FN1, GPIO_PT6_OFFSET)
#define GPIO37_VD3		CFG(7, FN1, GPIO_PT6_OFFSET)
#define GPIO38_VD4		CFG(8, FN1, GPIO_PT6_OFFSET)
#define GPIO39_VD5		CFG(9, FN1, GPIO_PT6_OFFSET)
#define GPIO40_VD6		CFG(10, FN1, GPIO_PT6_OFFSET)
#define GPIO41_VD7		CFG(11, FN1, GPIO_PT6_OFFSET)

#define GPIO30_KPROW0		CFG(0, FN2, GPIO_PT6_OFFSET)
#define GPIO31_KPROW1		CFG(1, FN2, GPIO_PT6_OFFSET)
#define GPIO32_KPROW2		CFG(2, FN2, GPIO_PT6_OFFSET)
#define GPIO33_KPROW3		CFG(3, FN2, GPIO_PT6_OFFSET)
#define GPIO34_KPCOL0		CFG(4, FN2, GPIO_PT6_OFFSET)
#define GPIO35_KPCOL1		CFG(5, FN2, GPIO_PT6_OFFSET)
#define GPIO36_KPCOL2		CFG(6, FN2, GPIO_PT6_OFFSET)
#define GPIO37_KPCOL3		CFG(7, FN2, GPIO_PT6_OFFSET)
#define GPIO38_KPCOL4		CFG(8, FN2, GPIO_PT6_OFFSET)
#define GPIO39_KPCOL5		CFG(9, FN2, GPIO_PT6_OFFSET)
#define GPIO40_KPCOL6		CFG(10, FN2, GPIO_PT6_OFFSET)
#define GPIO41_KPCOL7		CFG(11, FN2, GPIO_PT6_OFFSET)

#endif /* __ASM_ARCH_MFP_NUC710_H */

